In [1]:
### T-Test: Using the teachers' rating data set, does gender affect teaching evaluation rates?
### ANOVA: Using the teachers' rating data set, does beauty  score for instructors  differ by age?
### ANOVA: Using the teachers' rating data set, does teaching  evaluation  score for instructors  differ  by age?
### Chi-square: Using the teachers' rating data set, is there an association between tenure and gender?
### Correlation: Using the teachers rating dataset, Is teaching  evaluation  score correlated with  beauty score?
### Question 1: Using the teachers rating data set, does tenure affect teaching evaluation scores?

In [2]:
### T-Test: does gender affect teaching evaluation rates?

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import stats

In [3]:
df = pd.read_csv('data_cleaned.csv')

In [5]:
df.head()

,Airline,Source,Destination,Route,Total_Stops,Additional_Info,Price,journey_day,journey_month,dep_time_hour,dep_time_min,arrival_time_hour,arrival_time_min,Duration_hours,Duration_mins
0,IndiGo,Banglore,New Delhi,BLR → DEL,0,No info,3897,24,3,22,20,1,10,2,50
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,2,No info,7662,5,1,5,50,13,15,7,25
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,2,No info,13882,6,9,9,25,4,25,19,0
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,1,No info,6218,5,12,18,5,23,30,5,25
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,1,No info,13302,3,1,16,50,21,35,4,45

In [6]:
### T-Test:  does airline affect flight price?

In [20]:
lis = df['Source'].unique()

In [21]:
def source_avg(i):
    print( f"{i}  {df[df['Source'] == i]['Price'].mean()}")

In [22]:
for i in lis:
    source_avg(i)

Banglore  7248.11105882353
Kolkata  9150.449825783971
Delhi  10467.942920353982
Chennai  4789.892388451443
Mumbai  4921.6502890173415

In [26]:
Banglore = df[df['Source'] == 'Banglore']['Price']
Kolkata = df[df['Source'] == 'Kolkata']['Price']
Delhi  = df[df['Source'] == 'Delhi']['Price']
Chennai = df[df['Source'] == 'Chennai']['Price']
Mumbai= df[df['Source'] == 'Mumbai']['Price']

In [27]:
stats.f_oneway(Banglore,Kolkata ,Delhi,Chennai,Mumbai)

F_onewayResult(statistic=647.7499439958912, pvalue=0.0)

#### correlation

In [31]:
df['journey_day'].corr()['Price']

TypeError: corr() missing 1 required positional argument: 'other'

In [35]:
df.corr()['Price']

Total_Stops          0.667691
Price                1.000000
journey_day         -0.143818
journey_month        0.069031
dep_time_hour        0.006989
dep_time_min        -0.052967
arrival_time_hour    0.037664
arrival_time_min    -0.097244
Duration_hours       0.574937
Duration_mins       -0.139088
Name: Price, dtype: float64

In [36]:
stats.pearsonr(df['Total_Stops'],df['Price'])

(0.6676909308971324, 0.0)

### Chi-square: ' is there an association between airline and source'

In [4]:
pd.crosstab(index = df['Source'] ,columns =  df['Airline'])

Airline,Air Asia,Air India,GoAir,IndiGo,Jet Airways,Multiple carriers,Multiple carriers Premium economy,SpiceJet,Trujet,Vistara,Vistara Premium economy
Source,,,,,,,,,,,
Banglore,89,323,93,523,730,0,0,180,0,185,2
Chennai,0,25,0,184,0,0,0,128,0,43,1
Delhi,80,742,76,705,1586,1186,13,87,0,45,0
Kolkata,150,511,25,445,1256,0,0,300,0,183,0
Mumbai,0,135,0,196,215,0,0,122,1,23,0